---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternMirror
source: html/0d94aa7e-2fe3-f930-f57b-5a0309fb2d67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternMirror Property

"Component Mirror"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePatternMirror { get; }
```